Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/GD32VF103/Includes/Registers/GD32VF103_usbfs_host.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     GD32VF103_usbfs_host equates.
 */

#pragma once

#include    <stdint.h>

// USBFS_HOST address definitions
// ------------------------------

typedef struct {
    volatile    uint32_t    HCTL;
    volatile    uint32_t    HFT;
    volatile    uint32_t    HFINFR;
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    HPTFQSTAT;
    volatile    uint32_t    HACHINT;
    volatile    uint32_t    HACHINTEN;
    volatile    uint32_t    RESERVED1[9];
    volatile    uint32_t    HPCS;
    volatile    uint32_t    RESERVED2[47];
    volatile    uint32_t    HCH0CTL;
    volatile    uint32_t    RESERVED3;
    volatile    uint32_t    HCH0INTF;
    volatile    uint32_t    HCH0INTEN;
    volatile    uint32_t    HCH0LEN;
    volatile    uint32_t    RESERVED4[3];
    volatile    uint32_t    HCH1CTL;
    volatile    uint32_t    RESERVED5;
    volatile    uint32_t    HCH1INTF;
    volatile    uint32_t    HCH1INTEN;
    volatile    uint32_t    HCH1LEN;
    volatile    uint32_t    RESERVED6[3];
    volatile    uint32_t    HCH2CTL;
    volatile    uint32_t    RESERVED7;
    volatile    uint32_t    HCH2INTF;
    volatile    uint32_t    HCH2INTEN;
    volatile    uint32_t    HCH2LEN;
    volatile    uint32_t    RESERVED8[3];
    volatile    uint32_t    HCH3CTL;
    volatile    uint32_t    RESERVED9;
    volatile    uint32_t    HCH3INTF;
    volatile    uint32_t    HCH3INTEN;
    volatile    uint32_t    HCH3LEN;
    volatile    uint32_t    RESERVED10[3];
    volatile    uint32_t    HCH4CTL;
    volatile    uint32_t    RESERVED11;
    volatile    uint32_t    HCH4INTF;
    volatile    uint32_t    HCH4INTEN;
    volatile    uint32_t    HCH4LEN;
    volatile    uint32_t    RESERVED12[3];
    volatile    uint32_t    HCH5CTL;
    volatile    uint32_t    RESERVED13;
    volatile    uint32_t    HCH5INTF;
    volatile    uint32_t    HCH5INTEN;
    volatile    uint32_t    HCH5LEN;
    volatile    uint32_t    RESERVED14[3];
    volatile    uint32_t    HCH6CTL;
    volatile    uint32_t    RESERVED15;
    volatile    uint32_t    HCH6INTF;
    volatile    uint32_t    HCH6INTEN;
    volatile    uint32_t    HCH6LEN;
    volatile    uint32_t    RESERVED16[3];
    volatile    uint32_t    HCH7CTL;
    volatile    uint32_t    RESERVED17;
    volatile    uint32_t    HCH7INTF;
    volatile    uint32_t    HCH7INTEN;
    volatile    uint32_t    HCH7LEN;
} USBFS_HOST_TypeDef;

#ifdef __cplusplus
#define USBFS_HOST  reinterpret_cast<USBFS_HOST_TypeDef *>(0x50000400U)

#else
#define USBFS_HOST  ((USBFS_HOST_TypeDef *)0x50000400U)
#endif

// HCTL Configuration

#define USBFS_HOST_HCTL_CLKSEL          (0x3U<<0U)
#define USBFS_HOST_HCTL_CLKSEL_0        (0x1U<<0U)

// HFT Configuration

#define USBFS_HOST_HFT_FRI              (0xFFFFU<<0U)
#define USBFS_HOST_HFT_FRI_0            (0x1U<<0U)

// HFINFR Configuration

#define USBFS_HOST_HFINFR_FRT           (0xFFFFU<<16U)
#define USBFS_HOST_HFINFR_FRT_0         (0x1U<<16U)
#define USBFS_HOST_HFINFR_FRNUM         (0xFFFFU<<0U)
#define USBFS_HOST_HFINFR_FRNUM_0       (0x1U<<0U)

// HPTFQSTAT Configuration

#define USBFS_HOST_HPTFQSTAT_PTXREQT    (0xFFU<<24U)
#define USBFS_HOST_HPTFQSTAT_PTXREQT_0  (0x1U<<24U)
#define USBFS_HOST_HPTFQSTAT_PTXREQS    (0xFFU<<16U)
#define USBFS_HOST_HPTFQSTAT_PTXREQS_0  (0x1U<<16U)
#define USBFS_HOST_HPTFQSTAT_PTXFS      (0xFFFFU<<0U)
#define USBFS_HOST_HPTFQSTAT_PTXFS_0    (0x1U<<0U)

// HACHINT Configuration

#define USBFS_HOST_HACHINT_HACHINT      (0xFFU<<0U)
#define USBFS_HOST_HACHINT_HACHINT_0    (0x1U<<0U)

// HACHINTEN Configuration

#define USBFS_HOST_HACHINTEN_CINTEN     (0xFFU<<0U)
#define USBFS_HOST_HACHINTEN_CINTEN_0   (0x1U<<0U)

// HPCS Configuration

#define USBFS_HOST_HPCS_PS              (0x3U<<17U)
#define USBFS_HOST_HPCS_PS_0            (0x1U<<17U)
#define USBFS_HOST_HPCS_PP              (0x1U<<12U)
#define USBFS_HOST_HPCS_PLST            (0x3U<<10U)
#define USBFS_HOST_HPCS_PLST_0          (0x1U<<10U)
#define USBFS_HOST_HPCS_PRST            (0x1U<<8U)
#define USBFS_HOST_HPCS_PSP             (0x1U<<7U)
#define USBFS_HOST_HPCS_PREM            (0x1U<<6U)
#define USBFS_HOST_HPCS_PEDC            (0x1U<<3U)
#define USBFS_HOST_HPCS_PE              (0x1U<<2U)
#define USBFS_HOST_HPCS_PCD             (0x1U<<1U)
#define USBFS_HOST_HPCS_PCST            (0x1U<<0U)

// HCH0CTL Configuration

#define USBFS_HOST_HCH0CTL_CEN          (0x1U<<31U)
#define USBFS_HOST_HCH0CTL_CDIS         (0x1U<<30U)
#define USBFS_HOST_HCH0CTL_ODDFRM       (0x1U<<29U)
#define USBFS_HOST_HCH0CTL_DAR          (0x7FU<<22U)
#define USBFS_HOST_HCH0CTL_DAR_0        (0x1U<<22U)
#define USBFS_HOST_HCH0CTL_EPTYPE       (0x3U<<18U)
#define USBFS_HOST_HCH0CTL_EPTYPE_0     (0x1U<<18U)
#define USBFS_HOST_HCH0CTL_LSD          (0x1U<<17U)
#define USBFS_HOST_HCH0CTL_EPDIR        (0x1U<<15U)
#define USBFS_HOST_HCH0CTL_EPNUM        (0xFU<<11U)
#define USBFS_HOST_HCH0CTL_EPNUM_0      (0x1U<<11U)
#define USBFS_HOST_HCH0CTL_MPL          (0x7FFU<<0U)
#define USBFS_HOST_HCH0CTL_MPL_0        (0x1U<<0U)

// HCH0INTF Configuration

#define USBFS_HOST_HCH0INTF_DTER        (0x1U<<10U)
#define USBFS_HOST_HCH0INTF_REQOVR      (0x1U<<9U)
#define USBFS_HOST_HCH0INTF_BBER        (0x1U<<8U)
#define USBFS_HOST_HCH0INTF_USBER       (0x1U<<7U)
#define USBFS_HOST_HCH0INTF_ACK         (0x1U<<5U)
#define USBFS_HOST_HCH0INTF_NAK         (0x1U<<4U)
#define USBFS_HOST_HCH0INTF_STALL       (0x1U<<3U)
#define USBFS_HOST_HCH0INTF_CH          (0x1U<<1U)
#define USBFS_HOST_HCH0INTF_TF          (0x1U<<0U)

// HCH0INTEN Configuration

#define USBFS_HOST_HCH0INTEN_DTERIE     (0x1U<<10U)
#define USBFS_HOST_HCH0INTEN_REQOVRIE   (0x1U<<9U)
#define USBFS_HOST_HCH0INTEN_BBERIE     (0x1U<<8U)
#define USBFS_HOST_HCH0INTEN_USBERIE    (0x1U<<7U)
#define USBFS_HOST_HCH0INTEN_ACKIE      (0x1U<<5U)
#define USBFS_HOST_HCH0INTEN_NAKIE      (0x1U<<4U)
#define USBFS_HOST_HCH0INTEN_STALLIE    (0x1U<<3U)
#define USBFS_HOST_HCH0INTEN_CHIE       (0x1U<<1U)
#define USBFS_HOST_HCH0INTEN_TFIE       (0x1U<<0U)

// HCH0LEN Configuration

#define USBFS_HOST_HCH0LEN_DPID         (0x3U<<29U)
#define USBFS_HOST_HCH0LEN_DPID_0       (0x1U<<29U)
#define USBFS_HOST_HCH0LEN_PCNT         (0x3FFU<<19U)
#define USBFS_HOST_HCH0LEN_PCNT_0       (0x1U<<19U)
#define USBFS_HOST_HCH0LEN_TLEN         (0x7FFFFU<<0U)
#define USBFS_HOST_HCH0LEN_TLEN_0       (0x1U<<0U)

// HCH1CTL Configuration

#define USBFS_HOST_HCH1CTL_CEN          (0x1U<<31U)
#define USBFS_HOST_HCH1CTL_CDIS         (0x1U<<30U)
#define USBFS_HOST_HCH1CTL_ODDFRM       (0x1U<<29U)
#define USBFS_HOST_HCH1CTL_DAR          (0x7FU<<22U)
#define USBFS_HOST_HCH1CTL_DAR_0        (0x1U<<22U)
#define USBFS_HOST_HCH1CTL_EPTYPE       (0x3U<<18U)
#define USBFS_HOST_HCH1CTL_EPTYPE_0     (0x1U<<18U)
#define USBFS_HOST_HCH1CTL_LSD          (0x1U<<17U)
#define USBFS_HOST_HCH1CTL_EPDIR        (0x1U<<15U)
#define USBFS_HOST_HCH1CTL_EPNUM        (0xFU<<11U)
#define USBFS_HOST_HCH1CTL_EPNUM_0      (0x1U<<11U)
#define USBFS_HOST_HCH1CTL_MPL          (0x7FFU<<0U)
#define USBFS_HOST_HCH1CTL_MPL_0        (0x1U<<0U)

// HCH1INTF Configuration

#define USBFS_HOST_HCH1INTF_DTER        (0x1U<<10U)
#define USBFS_HOST_HCH1INTF_REQOVR      (0x1U<<9U)
#define USBFS_HOST_HCH1INTF_BBER        (0x1U<<8U)
#define USBFS_HOST_HCH1INTF_USBER       (0x1U<<7U)
#define USBFS_HOST_HCH1INTF_ACK         (0x1U<<5U)
#define USBFS_HOST_HCH1INTF_NAK         (0x1U<<4U)
#define USBFS_HOST_HCH1INTF_STALL       (0x1U<<3U)
#define USBFS_HOST_HCH1INTF_CH          (0x1U<<1U)
#define USBFS_HOST_HCH1INTF_TF          (0x1U<<0U)

// HCH1INTEN Configuration

#define USBFS_HOST_HCH1INTEN_DTERIE     (0x1U<<10U)
#define USBFS_HOST_HCH1INTEN_REQOVRIE   (0x1U<<9U)
#define USBFS_HOST_HCH1INTEN_BBERIE     (0x1U<<8U)
#define USBFS_HOST_HCH1INTEN_USBERIE    (0x1U<<7U)
#define USBFS_HOST_HCH1INTEN_ACKIE      (0x1U<<5U)
#define USBFS_HOST_HCH1INTEN_NAKIE      (0x1U<<4U)
#define USBFS_HOST_HCH1INTEN_STALLIE    (0x1U<<3U)
#define USBFS_HOST_HCH1INTEN_CHIE       (0x1U<<1U)
#define USBFS_HOST_HCH1INTEN_TFIE       (0x1U<<0U)

// HCH1LEN Configuration

#define USBFS_HOST_HCH1LEN_DPID         (0x3U<<29U)
#define USBFS_HOST_HCH1LEN_DPID_0       (0x1U<<29U)
#define USBFS_HOST_HCH1LEN_PCNT         (0x3FFU<<19U)
#define USBFS_HOST_HCH1LEN_PCNT_0       (0x1U<<19U)
#define USBFS_HOST_HCH1LEN_TLEN         (0x7FFFFU<<0U)
#define USBFS_HOST_HCH1LEN_TLEN_0       (0x1U<<0U)

// HCH2CTL Configuration

#define USBFS_HOST_HCH2CTL_CEN          (0x1U<<31U)
#define USBFS_HOST_HCH2CTL_CDIS         (0x1U<<30U)
#define USBFS_HOST_HCH2CTL_ODDFRM       (0x1U<<29U)
#define USBFS_HOST_HCH2CTL_DAR          (0x7FU<<22U)
#define USBFS_HOST_HCH2CTL_DAR_0        (0x1U<<22U)
#define USBFS_HOST_HCH2CTL_EPTYPE       (0x3U<<18U)
#define USBFS_HOST_HCH2CTL_EPTYPE_0     (0x1U<<18U)
#define USBFS_HOST_HCH2CTL_LSD          (0x1U<<17U)
#define USBFS_HOST_HCH2CTL_EPDIR        (0x1U<<15U)
#define USBFS_HOST_HCH2CTL_EPNUM        (0xFU<<11U)
#define USBFS_HOST_HCH2CTL_EPNUM_0      (0x1U<<11U)
#define USBFS_HOST_HCH2CTL_MPL          (0x7FFU<<0U)
#define USBFS_HOST_HCH2CTL_MPL_0        (0x1U<<0U)

// HCH2INTF Configuration

#define USBFS_HOST_HCH2INTF_DTER        (0x1U<<10U)
#define USBFS_HOST_HCH2INTF_REQOVR      (0x1U<<9U)
#define USBFS_HOST_HCH2INTF_BBER        (0x1U<<8U)
#define USBFS_HOST_HCH2INTF_USBER       (0x1U<<7U)
#define USBFS_HOST_HCH2INTF_ACK         (0x1U<<5U)
#define USBFS_HOST_HCH2INTF_NAK         (0x1U<<4U)
#define USBFS_HOST_HCH2INTF_STALL       (0x1U<<3U)
#define USBFS_HOST_HCH2INTF_CH          (0x1U<<1U)
#define USBFS_HOST_HCH2INTF_TF          (0x1U<<0U)

// HCH2INTEN Configuration

#define USBFS_HOST_HCH2INTEN_DTERIE     (0x1U<<10U)
#define USBFS_HOST_HCH2INTEN_REQOVRIE   (0x1U<<9U)
#define USBFS_HOST_HCH2INTEN_BBERIE     (0x1U<<8U)
#define USBFS_HOST_HCH2INTEN_USBERIE    (0x1U<<7U)
#define USBFS_HOST_HCH2INTEN_ACKIE      (0x1U<<5U)
#define USBFS_HOST_HCH2INTEN_NAKIE      (0x1U<<4U)
#define USBFS_HOST_HCH2INTEN_STALLIE    (0x1U<<3U)
#define USBFS_HOST_HCH2INTEN_CHIE       (0x1U<<1U)
#define USBFS_HOST_HCH2INTEN_TFIE       (0x1U<<0U)

// HCH2LEN Configuration

#define USBFS_HOST_HCH2LEN_DPID         (0x3U<<29U)
#define USBFS_HOST_HCH2LEN_DPID_0       (0x1U<<29U)
#define USBFS_HOST_HCH2LEN_PCNT         (0x3FFU<<19U)
#define USBFS_HOST_HCH2LEN_PCNT_0       (0x1U<<19U)
#define USBFS_HOST_HCH2LEN_TLEN         (0x7FFFFU<<0U)
#define USBFS_HOST_HCH2LEN_TLEN_0       (0x1U<<0U)

// HCH3CTL Configuration

#define USBFS_HOST_HCH3CTL_CEN          (0x1U<<31U)
#define USBFS_HOST_HCH3CTL_CDIS         (0x1U<<30U)
#define USBFS_HOST_HCH3CTL_ODDFRM       (0x1U<<29U)
#define USBFS_HOST_HCH3CTL_DAR          (0x7FU<<22U)
#define USBFS_HOST_HCH3CTL_DAR_0        (0x1U<<22U)
#define USBFS_HOST_HCH3CTL_EPTYPE       (0x3U<<18U)
#define USBFS_HOST_HCH3CTL_EPTYPE_0     (0x1U<<18U)
#define USBFS_HOST_HCH3CTL_LSD          (0x1U<<17U)
#define USBFS_HOST_HCH3CTL_EPDIR        (0x1U<<15U)
#define USBFS_HOST_HCH3CTL_EPNUM        (0xFU<<11U)
#define USBFS_HOST_HCH3CTL_EPNUM_0      (0x1U<<11U)
#define USBFS_HOST_HCH3CTL_MPL          (0x7FFU<<0U)
#define USBFS_HOST_HCH3CTL_MPL_0        (0x1U<<0U)

// HCH3INTF Configuration

#define USBFS_HOST_HCH3INTF_DTER        (0x1U<<10U)
#define USBFS_HOST_HCH3INTF_REQOVR      (0x1U<<9U)
#define USBFS_HOST_HCH3INTF_BBER        (0x1U<<8U)
#define USBFS_HOST_HCH3INTF_USBER       (0x1U<<7U)
#define USBFS_HOST_HCH3INTF_ACK         (0x1U<<5U)
#define USBFS_HOST_HCH3INTF_NAK         (0x1U<<4U)
#define USBFS_HOST_HCH3INTF_STALL       (0x1U<<3U)
#define USBFS_HOST_HCH3INTF_CH          (0x1U<<1U)
#define USBFS_HOST_HCH3INTF_TF          (0x1U<<0U)

// HCH3INTEN Configuration

#define USBFS_HOST_HCH3INTEN_DTERIE     (0x1U<<10U)
#define USBFS_HOST_HCH3INTEN_REQOVRIE   (0x1U<<9U)
#define USBFS_HOST_HCH3INTEN_BBERIE     (0x1U<<8U)
#define USBFS_HOST_HCH3INTEN_USBERIE    (0x1U<<7U)
#define USBFS_HOST_HCH3INTEN_ACKIE      (0x1U<<5U)
#define USBFS_HOST_HCH3INTEN_NAKIE      (0x1U<<4U)
#define USBFS_HOST_HCH3INTEN_STALLIE    (0x1U<<3U)
#define USBFS_HOST_HCH3INTEN_CHIE       (0x1U<<1U)
#define USBFS_HOST_HCH3INTEN_TFIE       (0x1U<<0U)

// HCH3LEN Configuration

#define USBFS_HOST_HCH3LEN_DPID         (0x3U<<29U)
#define USBFS_HOST_HCH3LEN_DPID_0       (0x1U<<29U)
#define USBFS_HOST_HCH3LEN_PCNT         (0x3FFU<<19U)
#define USBFS_HOST_HCH3LEN_PCNT_0       (0x1U<<19U)
#define USBFS_HOST_HCH3LEN_TLEN         (0x7FFFFU<<0U)
#define USBFS_HOST_HCH3LEN_TLEN_0       (0x1U<<0U)

// HCH4CTL Configuration

#define USBFS_HOST_HCH4CTL_CEN          (0x1U<<31U)
#define USBFS_HOST_HCH4CTL_CDIS         (0x1U<<30U)
#define USBFS_HOST_HCH4CTL_ODDFRM       (0x1U<<29U)
#define USBFS_HOST_HCH4CTL_DAR          (0x7FU<<22U)
#define USBFS_HOST_HCH4CTL_DAR_0        (0x1U<<22U)
#define USBFS_HOST_HCH4CTL_EPTYPE       (0x3U<<18U)
#define USBFS_HOST_HCH4CTL_EPTYPE_0     (0x1U<<18U)
#define USBFS_HOST_HCH4CTL_LSD          (0x1U<<17U)
#define USBFS_HOST_HCH4CTL_EPDIR        (0x1U<<15U)
#define USBFS_HOST_HCH4CTL_EPNUM        (0xFU<<11U)
#define USBFS_HOST_HCH4CTL_EPNUM_0      (0x1U<<11U)
#define USBFS_HOST_HCH4CTL_MPL          (0x7FFU<<0U)
#define USBFS_HOST_HCH4CTL_MPL_0        (0x1U<<0U)

// HCH4INTF Configuration

#define USBFS_HOST_HCH4INTF_DTER        (0x1U<<10U)
#define USBFS_HOST_HCH4INTF_REQOVR      (0x1U<<9U)
#define USBFS_HOST_HCH4INTF_BBER        (0x1U<<8U)
#define USBFS_HOST_HCH4INTF_USBER       (0x1U<<7U)
#define USBFS_HOST_HCH4INTF_ACK         (0x1U<<5U)
#define USBFS_HOST_HCH4INTF_NAK         (0x1U<<4U)
#define USBFS_HOST_HCH4INTF_STALL       (0x1U<<3U)
#define USBFS_HOST_HCH4INTF_CH          (0x1U<<1U)
#define USBFS_HOST_HCH4INTF_TF          (0x1U<<0U)

// HCH4INTEN Configuration

#define USBFS_HOST_HCH4INTEN_DTERIE     (0x1U<<10U)
#define USBFS_HOST_HCH4INTEN_REQOVRIE   (0x1U<<9U)
#define USBFS_HOST_HCH4INTEN_BBERIE     (0x1U<<8U)
#define USBFS_HOST_HCH4INTEN_USBERIE    (0x1U<<7U)
#define USBFS_HOST_HCH4INTEN_ACKIE      (0x1U<<5U)
#define USBFS_HOST_HCH4INTEN_NAKIE      (0x1U<<4U)
#define USBFS_HOST_HCH4INTEN_STALLIE    (0x1U<<3U)
#define USBFS_HOST_HCH4INTEN_CHIE       (0x1U<<1U)
#define USBFS_HOST_HCH4INTEN_TFIE       (0x1U<<0U)

// HCH4LEN Configuration

#define USBFS_HOST_HCH4LEN_DPID         (0x3U<<29U)
#define USBFS_HOST_HCH4LEN_DPID_0       (0x1U<<29U)
#define USBFS_HOST_HCH4LEN_PCNT         (0x3FFU<<19U)
#define USBFS_HOST_HCH4LEN_PCNT_0       (0x1U<<19U)
#define USBFS_HOST_HCH4LEN_TLEN         (0x7FFFFU<<0U)
#define USBFS_HOST_HCH4LEN_TLEN_0       (0x1U<<0U)

// HCH5CTL Configuration

#define USBFS_HOST_HCH5CTL_CEN          (0x1U<<31U)
#define USBFS_HOST_HCH5CTL_CDIS         (0x1U<<30U)
#define USBFS_HOST_HCH5CTL_ODDFRM       (0x1U<<29U)
#define USBFS_HOST_HCH5CTL_DAR          (0x7FU<<22U)
#define USBFS_HOST_HCH5CTL_DAR_0        (0x1U<<22U)
#define USBFS_HOST_HCH5CTL_EPTYPE       (0x3U<<18U)
#define USBFS_HOST_HCH5CTL_EPTYPE_0     (0x1U<<18U)
#define USBFS_HOST_HCH5CTL_LSD          (0x1U<<17U)
#define USBFS_HOST_HCH5CTL_EPDIR        (0x1U<<15U)
#define USBFS_HOST_HCH5CTL_EPNUM        (0xFU<<11U)
#define USBFS_HOST_HCH5CTL_EPNUM_0      (0x1U<<11U)
#define USBFS_HOST_HCH5CTL_MPL          (0x7FFU<<0U)
#define USBFS_HOST_HCH5CTL_MPL_0        (0x1U<<0U)

// HCH5INTF Configuration

#define USBFS_HOST_HCH5INTF_DTER        (0x1U<<10U)
#define USBFS_HOST_HCH5INTF_REQOVR      (0x1U<<9U)
#define USBFS_HOST_HCH5INTF_BBER        (0x1U<<8U)
#define USBFS_HOST_HCH5INTF_USBER       (0x1U<<7U)
#define USBFS_HOST_HCH5INTF_ACK         (0x1U<<5U)
#define USBFS_HOST_HCH5INTF_NAK         (0x1U<<4U)
#define USBFS_HOST_HCH5INTF_STALL       (0x1U<<3U)
#define USBFS_HOST_HCH5INTF_CH          (0x1U<<1U)
#define USBFS_HOST_HCH5INTF_TF          (0x1U<<0U)

// HCH5INTEN Configuration

#define USBFS_HOST_HCH5INTEN_DTERIE     (0x1U<<10U)
#define USBFS_HOST_HCH5INTEN_REQOVRIE   (0x1U<<9U)
#define USBFS_HOST_HCH5INTEN_BBERIE     (0x1U<<8U)
#define USBFS_HOST_HCH5INTEN_USBERIE    (0x1U<<7U)
#define USBFS_HOST_HCH5INTEN_ACKIE      (0x1U<<5U)
#define USBFS_HOST_HCH5INTEN_NAKIE      (0x1U<<4U)
#define USBFS_HOST_HCH5INTEN_STALLIE    (0x1U<<3U)
#define USBFS_HOST_HCH5INTEN_CHIE       (0x1U<<1U)
#define USBFS_HOST_HCH5INTEN_TFIE       (0x1U<<0U)

// HCH5LEN Configuration

#define USBFS_HOST_HCH5LEN_DPID         (0x3U<<29U)
#define USBFS_HOST_HCH5LEN_DPID_0       (0x1U<<29U)
#define USBFS_HOST_HCH5LEN_PCNT         (0x3FFU<<19U)
#define USBFS_HOST_HCH5LEN_PCNT_0       (0x1U<<19U)
#define USBFS_HOST_HCH5LEN_TLEN         (0x7FFFFU<<0U)
#define USBFS_HOST_HCH5LEN_TLEN_0       (0x1U<<0U)

// HCH6CTL Configuration

#define USBFS_HOST_HCH6CTL_CEN          (0x1U<<31U)
#define USBFS_HOST_HCH6CTL_CDIS         (0x1U<<30U)
#define USBFS_HOST_HCH6CTL_ODDFRM       (0x1U<<29U)
#define USBFS_HOST_HCH6CTL_DAR          (0x7FU<<22U)
#define USBFS_HOST_HCH6CTL_DAR_0        (0x1U<<22U)
#define USBFS_HOST_HCH6CTL_EPTYPE       (0x3U<<18U)
#define USBFS_HOST_HCH6CTL_EPTYPE_0     (0x1U<<18U)
#define USBFS_HOST_HCH6CTL_LSD          (0x1U<<17U)
#define USBFS_HOST_HCH6CTL_EPDIR        (0x1U<<15U)
#define USBFS_HOST_HCH6CTL_EPNUM        (0xFU<<11U)
#define USBFS_HOST_HCH6CTL_EPNUM_0      (0x1U<<11U)
#define USBFS_HOST_HCH6CTL_MPL          (0x7FFU<<0U)
#define USBFS_HOST_HCH6CTL_MPL_0        (0x1U<<0U)

// HCH6INTF Configuration

#define USBFS_HOST_HCH6INTF_DTER        (0x1U<<10U)
#define USBFS_HOST_HCH6INTF_REQOVR      (0x1U<<9U)
#define USBFS_HOST_HCH6INTF_BBER        (0x1U<<8U)
#define USBFS_HOST_HCH6INTF_USBER       (0x1U<<7U)
#define USBFS_HOST_HCH6INTF_ACK         (0x1U<<5U)
#define USBFS_HOST_HCH6INTF_NAK         (0x1U<<4U)
#define USBFS_HOST_HCH6INTF_STALL       (0x1U<<3U)
#define USBFS_HOST_HCH6INTF_CH          (0x1U<<1U)
#define USBFS_HOST_HCH6INTF_TF          (0x1U<<0U)

// HCH6INTEN Configuration

#define USBFS_HOST_HCH6INTEN_DTERIE     (0x1U<<10U)
#define USBFS_HOST_HCH6INTEN_REQOVRIE   (0x1U<<9U)
#define USBFS_HOST_HCH6INTEN_BBERIE     (0x1U<<8U)
#define USBFS_HOST_HCH6INTEN_USBERIE    (0x1U<<7U)
#define USBFS_HOST_HCH6INTEN_ACKIE      (0x1U<<5U)
#define USBFS_HOST_HCH6INTEN_NAKIE      (0x1U<<4U)
#define USBFS_HOST_HCH6INTEN_STALLIE    (0x1U<<3U)
#define USBFS_HOST_HCH6INTEN_CHIE       (0x1U<<1U)
#define USBFS_HOST_HCH6INTEN_TFIE       (0x1U<<0U)

// HCH6LEN Configuration

#define USBFS_HOST_HCH6LEN_DPID         (0x3U<<29U)
#define USBFS_HOST_HCH6LEN_DPID_0       (0x1U<<29U)
#define USBFS_HOST_HCH6LEN_PCNT         (0x3FFU<<19U)
#define USBFS_HOST_HCH6LEN_PCNT_0       (0x1U<<19U)
#define USBFS_HOST_HCH6LEN_TLEN         (0x7FFFFU<<0U)
#define USBFS_HOST_HCH6LEN_TLEN_0       (0x1U<<0U)

// HCH7CTL Configuration

#define USBFS_HOST_HCH7CTL_CEN          (0x1U<<31U)
#define USBFS_HOST_HCH7CTL_CDIS         (0x1U<<30U)
#define USBFS_HOST_HCH7CTL_ODDFRM       (0x1U<<29U)
#define USBFS_HOST_HCH7CTL_DAR          (0x7FU<<22U)
#define USBFS_HOST_HCH7CTL_DAR_0        (0x1U<<22U)
#define USBFS_HOST_HCH7CTL_EPTYPE       (0x3U<<18U)
#define USBFS_HOST_HCH7CTL_EPTYPE_0     (0x1U<<18U)
#define USBFS_HOST_HCH7CTL_LSD          (0x1U<<17U)
#define USBFS_HOST_HCH7CTL_EPDIR        (0x1U<<15U)
#define USBFS_HOST_HCH7CTL_EPNUM        (0xFU<<11U)
#define USBFS_HOST_HCH7CTL_EPNUM_0      (0x1U<<11U)
#define USBFS_HOST_HCH7CTL_MPL          (0x7FFU<<0U)
#define USBFS_HOST_HCH7CTL_MPL_0        (0x1U<<0U)

// HCH7INTF Configuration

#define USBFS_HOST_HCH7INTF_DTER        (0x1U<<10U)
#define USBFS_HOST_HCH7INTF_REQOVR      (0x1U<<9U)
#define USBFS_HOST_HCH7INTF_BBER        (0x1U<<8U)
#define USBFS_HOST_HCH7INTF_USBER       (0x1U<<7U)
#define USBFS_HOST_HCH7INTF_ACK         (0x1U<<5U)
#define USBFS_HOST_HCH7INTF_NAK         (0x1U<<4U)
#define USBFS_HOST_HCH7INTF_STALL       (0x1U<<3U)
#define USBFS_HOST_HCH7INTF_CH          (0x1U<<1U)
#define USBFS_HOST_HCH7INTF_TF          (0x1U<<0U)

// HCH7INTEN Configuration

#define USBFS_HOST_HCH7INTEN_DTERIE     (0x1U<<10U)
#define USBFS_HOST_HCH7INTEN_REQOVRIE   (0x1U<<9U)
#define USBFS_HOST_HCH7INTEN_BBERIE     (0x1U<<8U)
#define USBFS_HOST_HCH7INTEN_USBERIE    (0x1U<<7U)
#define USBFS_HOST_HCH7INTEN_ACKIE      (0x1U<<5U)
#define USBFS_HOST_HCH7INTEN_NAKIE      (0x1U<<4U)
#define USBFS_HOST_HCH7INTEN_STALLIE    (0x1U<<3U)
#define USBFS_HOST_HCH7INTEN_CHIE       (0x1U<<1U)
#define USBFS_HOST_HCH7INTEN_TFIE       (0x1U<<0U)

// HCH7LEN Configuration

#define USBFS_HOST_HCH7LEN_DPID         (0x3U<<29U)
#define USBFS_HOST_HCH7LEN_DPID_0       (0x1U<<29U)
#define USBFS_HOST_HCH7LEN_PCNT         (0x3FFU<<19U)
#define USBFS_HOST_HCH7LEN_PCNT_0       (0x1U<<19U)
#define USBFS_HOST_HCH7LEN_TLEN         (0x7FFFFU<<0U)
#define USBFS_HOST_HCH7LEN_TLEN_0       (0x1U<<0U)
